# RegenerationAttribute Properties

---
The RegenerationAttribute type exposes the following members.
| Name| Description
---|---|---
| Option| Regeneration option.
| TypeId| When implemented in a derived class, gets a unique identifier for this Attribute.(Inherited from Attribute)
Top
#### Reference
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace